/*Задача 1.1.4 (Тема 5). Возможно вам придется гуглить и ориентироваться на местности - это нормально.
Исправьте ошибки в коде:*/

package javaapplication8;

public class Calculator {
    public static void main(String[] args) {

        System.out.println("Привет!");

        float x = 2.0f - 1.2f;
        float y = x;
        System.out.println(y);
    }
}