/*Задача 1.1.7-a (Тема 4). Пусть x = -10; сколько будет Math.sqrt (x) ?
Выведите на печать это значение.*/

package javaapplication8;

public class Calculator {
    public static void main(String[] args) {
        int x = -10;
        System.out.println(Math.sqrt(x));
    }
}